
import requests
import json
def get_address():
    res = []
    other = []
    # 可以通过pandas读取 但是数据太少了,直接复制更快
    nums = ['18529389283', '13112861564', '18319717364', '13501509001', '13160808247', '18148669780', '13046138848',
            '18100263217', '19876224718', '15989844472', '13553725189', '14718067353', '13435500574', '15815096965',
            '17841718418', '13434238138', '16782450290', '13425228186', '19126600323', '13724633181', '19896825184',
            '15724146220', '15361356362', '13413537553', '13417086422', '13719560861', '18719356954', '13668998469',
            '18219102847', '13376535205', '17879554219', '18823507026', '15728282661', '13790701146', '18198430039',
            '18946968471', '13202470918', '17880683198', '18312595570', '13286556022', '14760437740', '15220665519',
            '18927801939', '13680567879', '13533112180', '18475268786', '17666251120', '17384679196', '18476708479',
            '19124697389', '18038588912', '13902503168', '15112911906', '15875279867', '18319868252', '13632399426',
            '15171546719', '18026260531']

    for i in range(len(nums)):
        url = "https://eolink.o.apispace.com/phone/api/v1/forward/china/phone/attribution"

        payload = {"phone_number": nums[i]}

        headers = {
            "X-APISpace-Token": "dw0w3vb3p5kbx1ejg4xmtc6tk27upuxp",
            "Authorization-Type": "apikey"
        }

        response = requests.request("GET", url, params=payload, headers=headers)

        # 将数据转化为字典
        try:
            datadict = json.loads(response.text)
            print(datadict)
            if datadict['data']['province'] == "广东":
                res.append(datadict['data']['city'])
                print()
            else:
                other.append(datadict['data']['province'])
        except:
            print(f"第{i}条数据有误, 请手动解决")
            continue
get_address()
# # 获取到了数据如下(数据较少)-> 为了不浪费空间 直接复制下
#
# res = ['广州', '东莞', '梅州', '广州', '广州', '佛山', '汕尾', '佛山', '河源', '汕头', '潮州', '梅州', '河源', '汕头', '汕头', '广州', '清远', '湛江', '佛山',
#        '梅州', '茂名', '中山', '清远', '汕头', '汕尾', '梅州', '广州', '湛江', '揭阳', '潮州', '汕头', '中山', '惠州', '揭阳', '佛山', '茂名', '茂名', '肇庆',
#        '清远', '惠州', '韶关', '阳江', '广州', '肇庆', '东莞', '河源', '肇庆', '梅州', '湛江', '佛山', '惠州', '潮州', '广州', '广州']
#
# other = ['江西', '海南', '湖北']

# region_count = {}
# for like in res:
#     if like not in region_count:
#         region_count[like] = 0
#     region_count[like] += 1

# list_tuple = []
# for key in region_count:
#     list_tuple.append((key, region_count.get(key)))
# print(list_tuple)

# # 为了不浪费资源 -> 直接复制下来
# list_tuple = [('广州', 8), ('东莞', 2), ('梅州', 5), ('佛山', 5), ('汕尾', 2), ('河源', 3), ('汕头', 5), ('潮州', 3), ('清远', 3),
#               ('湛江', 3), ('茂名', 3), ('中山', 2), ('揭阳', 2), ('惠州', 3), ('肇庆', 3), ('韶关', 1), ('阳江', 1)]
